MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_uart.h
  * @brief   Header file of UART HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_UART_H
#define STM32C5XX_HAL_UART_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_usart.h"
#include "stm32c5xx_ll_lpuart.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(USART1) || defined(USART2) || defined(USART3) || defined(UART4) || defined(UART5) || defined(USART6) \
 || defined(UART7) || defined (LPUART1)
/** @defgroup UART UART
  * @{
  */

/** @defgroup UART_Exported_Types HAL UART Types
  * @{
  */
/**
  * @brief HAL UART Instance Definition.
  *
  */
typedef enum
{
  /*! Instance USART1 */
  HAL_UART1 = USART1_BASE,
  /*! Instance USART2 */
  HAL_UART2 = USART2_BASE,
#if defined(USART3)
  /*! Instance USART3 */
  HAL_UART3 = USART3_BASE,
#endif /* USART3 */
  /*! Instance UART4 */
  HAL_UART4 = UART4_BASE,
  /*! Instance UART5 */
  HAL_UART5 = UART5_BASE,
#if defined(USART6)
  /*! Instance USART6 */
  HAL_UART6 = USART6_BASE,
#endif /* USART6 */
#if defined(UART7)
  /*! Instance UART7 */
  HAL_UART7 = UART7_BASE,
#endif /* UART7 */
  /*! Instance LPUART1 */
  HAL_LPUART1 = LPUART1_BASE,
} hal_uart_t;

/**
  * @brief HAL UART State Structure Definition.
  */
typedef enum
{
  /*! Peripheral is not initialized */
  HAL_UART_STATE_RESET                     = 0U,
  /*! Peripheral is initialized but not configured */
  HAL_UART_STATE_INIT                      = (1UL << 31U),
  /*! Peripheral is initialized and a global config is set */
  HAL_UART_STATE_CONFIGURED                = (1UL << 30U),
} hal_uart_state_t;

/**
  * @brief HAL UART Reception State Definition.
  */
typedef enum
{
  /*! Data Reception process is in reset */
  HAL_UART_RX_STATE_RESET                  = (1UL << 31U),
  /*! Data Reception process is in idle */
  HAL_UART_RX_STATE_IDLE                   = (1UL << 30U),
  /*! Data Reception process is ongoing */
  HAL_UART_RX_STATE_ACTIVE                 = (1UL << 29U),
  /*! Data Reception process is paused */
  HAL_UART_RX_STATE_PAUSED                 = (1UL << 28U),
  /*! Data Reception process is aborting */
  HAL_UART_RX_STATE_ABORT                  = (1UL << 27U),
} hal_uart_rx_state_t;

/**
  * @brief HAL UART Transmission State Definition.
  */
typedef enum
{
  /*! Data Transmission process is in reset */
  HAL_UART_TX_STATE_RESET                  = (1UL << 31U),
  /*! Data Transmission process is in idle */
  HAL_UART_TX_STATE_IDLE                   = (1UL << 30U),
  /*! Data Transmission process is ongoing */
  HAL_UART_TX_STATE_ACTIVE                 = (1UL << 29U),
  /*! Data Transmission process is paused */
  HAL_UART_TX_STATE_PAUSED                 = (1UL << 28U),
  /*! Data Transmission process is aborting */
  HAL_UART_TX_STATE_ABORT                  = (1UL << 27U),
} hal_uart_tx_state_t;

/** @addtogroup UART_Basic_config UART Basic configuration Definition
  * @{
  */
/**
  * @brief HAL UART Wordlength Definition.
  */
typedef enum
{
  /*! 7-bit long UART frame */
  HAL_UART_WORD_LENGTH_7_BIT               = LL_USART_DATAWIDTH_7_BIT,
  /*! 8-bit long UART frame */
  HAL_UART_WORD_LENGTH_8_BIT               = LL_USART_DATAWIDTH_8_BIT,
  /*! 9-bit long UART frame */
  HAL_UART_WORD_LENGTH_9_BIT               = LL_USART_DATAWIDTH_9_BIT,
} hal_uart_word_length_t;

/**
  * @brief HAL UART Stop Bits Definition.
  */
typedef enum
{
  /*! UART frame with 0.5 stop bit */
  HAL_UART_STOP_BIT_0_5                    = LL_USART_STOP_BIT_0_5,
  /*! UART frame with 1 stop bit */
  HAL_UART_STOP_BIT_1                      = LL_USART_STOP_BIT_1,
  /*! UART frame with 1.5 stop bits */
  HAL_UART_STOP_BIT_1_5                    = LL_USART_STOP_BIT_1_5,
  /*! UART frame with 2 stop bits */
  HAL_UART_STOP_BIT_2                      = LL_USART_STOP_BIT_2,
} hal_uart_stop_bits_t;

/**
  * @brief HAL UART Parity Definition.
  * @note When parity is enabled, the computed parity is inserted
          at the MSB position of the transmitted data (9th bit when
          the word length is set to 9 data bits; 8th bit when the
          word length is set to 8 data bits).
  */
typedef enum
{
  /*! No parity */
  HAL_UART_PARITY_NONE                     = LL_USART_PARITY_NONE,
  /*! Even parity */
  HAL_UART_PARITY_EVEN                     = LL_USART_PARITY_EVEN,
  /*! Odd parity */
  HAL_UART_PARITY_ODD                      = LL_USART_PARITY_ODD,
} hal_uart_parity_t;

/**
  * @brief HAL UART hardware control definition.
  */
typedef enum
{
  /*! No hardware control */
  HAL_UART_HW_CONTROL_NONE                 = LL_USART_HWCONTROL_NONE,
  /*! Request To Send */
  HAL_UART_HW_CONTROL_RTS                  = LL_USART_HWCONTROL_RTS,
  /*! Clear To Send */
  HAL_UART_HW_CONTROL_CTS                  = LL_USART_HWCONTROL_CTS,
  /*! Request and Clear To Send */
  HAL_UART_HW_CONTROL_RTS_CTS              = LL_USART_HWCONTROL_RTS_CTS,
} hal_uart_hw_control_t;

/**
  * @brief HAL UART direction definition.
  */
typedef enum
{
  /*! RX mode */
  HAL_UART_DIRECTION_RX                    = LL_USART_DIRECTION_RX,
  /*! TX mode */
  HAL_UART_DIRECTION_TX                    = LL_USART_DIRECTION_TX,
  /*! RX and TX mode */
  HAL_UART_DIRECTION_TX_RX                 = LL_USART_DIRECTION_TX_RX,
} hal_uart_direction_t;

/**
  * @brief HAL UART oversampling definition.
  */
typedef enum
{
  /*! Oversampling by 16 */
  HAL_UART_OVERSAMPLING_16                = LL_USART_OVERSAMPLING_16,
  /*! Oversampling by 8. LPUART instances do not support this mode, USARTx instances are configured
      in LIN mode as well. */
  HAL_UART_OVERSAMPLING_8                 = LL_USART_OVERSAMPLING_8,
} hal_uart_oversampling_t;

/**
  * @brief HAL UART one-bit sampling definition.
  * @note Selecting the single sample method increases the receiver tolerance to clock deviations.
  */
typedef enum
{
  /*! One-bit sampling disabled */
  HAL_UART_ONE_BIT_SAMPLE_DISABLE          = LL_USART_ONE_BIT_SAMPLE_DISABLE,
  /*! One-bit sampling enabled */
  HAL_UART_ONE_BIT_SAMPLE_ENABLE           = LL_USART_ONE_BIT_SAMPLE_ENABLE,
} hal_uart_one_bit_sample_t;

/**
  * @brief HAL UART clock prescaler definition.
  */
typedef enum
{
  /*! fclk_pres = fclk */
  HAL_UART_PRESCALER_DIV1                  = LL_USART_PRESCALER_DIV1,
  /*! fclk_pres = fclk/2 */
  HAL_UART_PRESCALER_DIV2                  = LL_USART_PRESCALER_DIV2,
  /*! fclk_pres = fclk/4 */
  HAL_UART_PRESCALER_DIV4                  = LL_USART_PRESCALER_DIV4,
  /*! fclk_pres = fclk/6 */
  HAL_UART_PRESCALER_DIV6                  = LL_USART_PRESCALER_DIV6,
  /*! fclk_pres = fclk/8 */
  HAL_UART_PRESCALER_DIV8                  = LL_USART_PRESCALER_DIV8,
  /*! fclk_pres = fclk/10 */
  HAL_UART_PRESCALER_DIV10                 = LL_USART_PRESCALER_DIV10,
  /*! fclk_pres = fclk/12 */
  HAL_UART_PRESCALER_DIV12                 = LL_USART_PRESCALER_DIV12,
  /*! fclk_pres = fclk/16 */
  HAL_UART_PRESCALER_DIV16                 = LL_USART_PRESCALER_DIV16,
  /*! fclk_pres = fclk/32 */
  HAL_UART_PRESCALER_DIV32                 = LL_USART_PRESCALER_DIV32,
  /*! fclk_pres = fclk/64 */
  HAL_UART_PRESCALER_DIV64                 = LL_USART_PRESCALER_DIV64,
  /*! fclk_pres = fclk/128 */
  HAL_UART_PRESCALER_DIV128                = LL_USART_PRESCALER_DIV128,
  /*! fclk_pres = fclk/256 */
  HAL_UART_PRESCALER_DIV256                = LL_USART_PRESCALER_DIV256,
} hal_uart_prescaler_t;

/**
  * @}
  */
/** @addtogroup UART_AutoBaudRate UART auto baud rate definition
  * @{
  */
/**
  * @brief HAL UART auto baud rate mode definition.
  */
typedef enum
{
  /*! Auto Baud Rate detection on start bit */
  HAL_UART_AUTO_BAUD_DET_ON_START_BIT     = LL_USART_AUTO_BAUD_DETECT_ON_START_BIT,
  /*! Auto Baud Rate detection on falling edge */
  HAL_UART_AUTO_BAUD_DET_ON_FALLING_EDGE  = LL_USART_AUTO_BAUD_DETECT_ON_FALLING_EDGE,
  /*! Auto Baud Rate detection on 0x7F frame detection */
  HAL_UART_AUTO_BAUD_DET_ON_0X7F_FRAME    = LL_USART_AUTO_BAUD_DETECT_ON_0X7F_FRAME,
  /*! Auto Baud Rate detection on 0x55 frame detection */
  HAL_UART_AUTO_BAUD_DET_ON_0X55_FRAME    = LL_USART_AUTO_BAUD_DETECT_ON_0X55_FRAME,
} hal_uart_auto_baud_rate_mode_t;

/**
  * @brief HAL UART auto baud rate detection definition.
  */
typedef enum
{
  /*! Auto baud rate detection not enabled */
  HAL_UART_AUTO_BAUD_RATE_DET_NOT_ENABLED  = 0U,
  /*! Auto baud rate detection started */
  HAL_UART_AUTO_BAUD_RATE_DET_ONGOING      = 1U,
  /*! Auto baud rate detection successful */
  HAL_UART_AUTO_BAUD_RATE_DET_SUCCESS      = 2U,
  /*! Auto baud rate detection error */
  HAL_UART_AUTO_BAUD_RATE_DET_ERROR        = 3U,
} hal_uart_auto_baud_rate_detection_status_t;

/**
  * @brief HAL UART auto baud rate status definition.
  */
typedef enum
{
  /*! UART auto baud rate is disabled */
  HAL_UART_AUTO_BAUD_RATE_DISABLED         = 0U,
  /*! UART auto baud rate is enabled */
  HAL_UART_AUTO_BAUD_RATE_ENABLED          = 1U,
} hal_uart_auto_baud_rate_status_t;
/**
  * @}
  */
/** @addtogroup UART_Modes UART modes definition
  * @{
  */
/**
  * @brief HAL UART multiprocessor mute mode wake-up method definition.
  */
typedef enum
{
  /*! UART wake-up on idle line */
  HAL_UART_WAKEUP_METHOD_IDLE_LINE         = LL_USART_WAKEUP_METHOD_IDLE_LINE,
  /*! UART wake-up on address mark */
  HAL_UART_WAKEUP_METHOD_ADDRESS_MARK      = LL_USART_WAKEUP_METHOD_ADDRESS_MARK,
} hal_uart_wakeup_method_t;

/**
  * @brief HAL UART multiprocessor mute mode status.
  */
typedef enum
{
  /*! UART in active mode */
  HAL_UART_MULTIPROCESSOR_MODE_IN_ACTIVE   = 0U,
  /*! UART in mute mode */
  HAL_UART_MULTIPROCESSOR_MODE_IN_MUTE     = 1U,
} hal_uart_multi_processor_mode_mute_status_t;

/**
  * @brief HAL UART LIN break detect length definition.
  */
typedef enum
{
  /*! LIN 10-bit break detection length */
  HAL_UART_LIN_BREAK_DETECT_10_BIT  = LL_USART_LIN_BREAK_DETECT_10_BIT,
  /*! LIN 11-bit break detection length */
  HAL_UART_LIN_BREAK_DETECT_11_BIT  = LL_USART_LIN_BREAK_DETECT_11_BIT,
} hal_uart_lin_break_detect_length_t;

/**
  * @brief HAL UART driver enable (DE) polarity definition.
  */
typedef enum
{
  /*! Driver Enable(DE) Polarity High */
  HAL_UART_DE_POLARITY_HIGH                = LL_USART_DE_POLARITY_HIGH,
  /*! Driver Enable(DE) Polarity Low */
  HAL_UART_DE_POLARITY_LOW                 = LL_USART_DE_POLARITY_LOW,
} hal_uart_de_polarity_t;

/**
  * @}
  */

