MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
/** @addtogroup UART_Stop_Mode UART Stop Mode Definition
  * @{
  */
/**
  * @brief HAL UART stop mode status definition.
  */
typedef enum
{
  /*! UART not functional in low-power mode */
  HAL_UART_STOP_MODE_DISABLED              = 0U,
  /*! UART functional in low-power mode */
  HAL_UART_STOP_MODE_ENABLED               = 1U,
} hal_uart_stop_mode_status_t;

/**
  * @brief HAL UART stop mode wake-up source definition.
  */
typedef enum
{
  /*! UART wake-up on address */
  HAL_UART_WAKEUP_ON_ADDRESS               = LL_USART_WAKEUP_ON_ADDRESS,
  /*! UART wake-up on start bit */
  HAL_UART_WAKEUP_ON_STARTBIT              = LL_USART_WAKEUP_ON_STARTBIT,
  /*! UART wake-up on receive data register not empty or Rx FIFO is not empty */
  HAL_UART_WAKEUP_ON_READDATA_NONEMPTY     = LL_USART_WAKEUP_ON_RXNE
} hal_uart_wakeup_source_t;

/**
  * @brief HAL UART address detection length definition.
  */
typedef enum
{
  /*! 4-bit long wake-up address */
  HAL_UART_ADDRESS_DETECT_4_BIT            = LL_USART_ADDRESS_DETECT_4_BIT,
  /*! 7-bit long wake-up address */
  HAL_UART_ADDRESS_DETECT_7_BIT            = LL_USART_ADDRESS_DETECT_7_BIT,
} hal_uart_address_detect_length_t;

/**
  * @}
  */

/**
  * @brief HAL UART reception mode definition.
  */
typedef enum
{
  /*! Standard reception */
  HAL_UART_RX_STANDARD              = 0U,
  /*! Reception till completion or IDLE event */
  HAL_UART_RX_TO_IDLE               = 1U,
  /*! Reception till completion or Receive TimeOut(RTO) event */
  HAL_UART_RX_TO_RTO                = 2U,
  /*! Reception till completion or character match (CM) event */
  HAL_UART_RX_TO_CHAR_MATCH         = 3U,
} hal_uart_rx_modes_t;

/**
  * @brief HAL UART reception event types definition.
  */
typedef enum
{
  /*! RxEvent linked to Transfer Complete event */
  HAL_UART_RX_EVENT_TC                     = 0U,
  /*! RxEvent linked to IDLE event */
  HAL_UART_RX_EVENT_IDLE                   = 1U,
  /*! RxEvent linked to TimeOut event */
  HAL_UART_RX_EVENT_RTO                = 2U,
  /*! RxEvent linked to Character Match event */
  HAL_UART_RX_EVENT_CHAR_MATCH              = 3U,
} hal_uart_rx_event_types_t;

/** @defgroup UART_FIFO_Mode UART FIFO Mode Definition
  * @{
  */

/**
  * @brief HAL UART FIFO threshold definition.
  */
typedef enum
{
  /*! FIFO reaches 1/8 of its depth */
  HAL_UART_FIFO_THRESHOLD_1_8              = LL_USART_FIFO_THRESHOLD_1_8,
  /*! FIFO reaches 1/4 of its depth */
  HAL_UART_FIFO_THRESHOLD_1_4              = LL_USART_FIFO_THRESHOLD_1_4,
  /*! FIFO reaches 1/2 of its depth */
  HAL_UART_FIFO_THRESHOLD_1_2              = LL_USART_FIFO_THRESHOLD_1_2,
  /*! FIFO reaches 3/4 of its depth */
  HAL_UART_FIFO_THRESHOLD_3_4              = LL_USART_FIFO_THRESHOLD_3_4,
  /*! FIFO reaches 7/8 of its depth */
  HAL_UART_FIFO_THRESHOLD_7_8              = LL_USART_FIFO_THRESHOLD_7_8,
  /*! FIFO reaches 8/8 of its depth */
  HAL_UART_FIFO_THRESHOLD_8_8              = LL_USART_FIFO_THRESHOLD_8_8,
} hal_uart_fifo_threshold_t;

/**
  * @brief HAL UART FIFO mode status definition.
  */
typedef enum
{
  /*! UART FIFO mode is disabled */
  HAL_UART_FIFO_MODE_DISABLED              = 0U,
  /*! UART FIFO mode is enabled */
  HAL_UART_FIFO_MODE_ENABLED               = 1U,
} hal_uart_fifo_mode_status_t;
/**
  * @}
  */

/** @addtogroup UART_Advanced_config UART Advanced Configuration Definition
  * @{
  */
/**
  * @brief HAL UART TX Pin Level Invert Status Definition.
  */
typedef enum
{
  /*! UART Tx Pin Level Inversion is disabled */
  HAL_UART_TX_PIN_LEVEL_INVERT_DISABLED    = 0U,
  /*! UART Tx Pin Level Inversion is enabled */
  HAL_UART_TX_PIN_LEVEL_INVERT_ENABLED     = 1U,
} hal_uart_tx_pin_level_invert_status_t;

/**
  * @brief HAL UART Rx pin level invert status definition.
  */
typedef enum
{
  /*! UART Rx Pin Level Inversion is disabled */
  HAL_UART_RX_PIN_LEVEL_INVERT_DISABLED    = 0U,
  /*! UART Rx Pin Level Inversion is enabled */
  HAL_UART_RX_PIN_LEVEL_INVERT_ENABLED     = 1U,
} hal_uart_rx_pin_level_invert_status_t;

/**
  * @brief HAL UART data invert status definition.
  */
typedef enum
{
  /*! UART Data Binary Inversion is disabled */
  HAL_UART_DATA_INVERT_DISABLED            = 0U,
  /*! UART Data Binary Inversion is enabled */
  HAL_UART_DATA_INVERT_ENABLED             = 1U,
} hal_uart_data_invert_status_t;

/**
  * @brief HAL UART swap Tx/Rx status definition.
  */
typedef enum
{
  /*! UART Tx Rx Swap Pins is disabled */
  HAL_UART_TX_RX_SWAP_DISABLED             = 0U,
  /*! UART Tx Rx Swap Pins is enabled */
  HAL_UART_TX_RX_SWAP_ENABLED              = 1U,
} hal_uart_tx_rx_swap_status_t;

/**
  * @brief HAL UART overrun status definition.
  */
typedef enum
{
  /*! UART Rx Overrun Detection is disabled */
  HAL_UART_RX_OVERRUN_DETECTION_DISABLED   = 0U,
  /*! UART Rx Overrun Detection is enabled */
  HAL_UART_RX_OVERRUN_DETECTION_ENABLED    = 1U,
} hal_uart_rx_overrun_detection_status_t;

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
/**
  * @brief HAL UART DMA disable on Rx error status definition.
  */
typedef enum
{
  /*! UART DMA Stop On Rx Error is disabled */
  HAL_UART_DMA_STOP_ON_RX_ERROR_DISABLED   = 0U,
  /*! UART DMA Stop On Rx Error is enabled */
  HAL_UART_DMA_STOP_ON_RX_ERROR_ENABLED    = 1U,
} hal_uart_dma_stop_on_rx_error_status_t;
#endif /* USE_HAL_UART_DMA */

/**
  * @brief HAL UART Most Significant Bit First Status Definition.
  */
typedef enum
{
  /*! UART Most Significant Bit First is disabled */
  HAL_UART_MSB_FIRST_DISABLED              = 0U,
  /*! UART Most Significant Bit First is enabled */
  HAL_UART_MSB_FIRST_ENABLED               = 1U,
} hal_uart_msb_first_status_t;

/**
  * @brief HAL UART receiver timeout status definition.
  */
typedef enum
{
  /*! UART Receiver TimeOut is disabled */
  HAL_UART_RECEIVER_TIMEOUT_DISABLED       = 0U,
  /*! UART Receiver TimeOut is enabled */
  HAL_UART_RECEIVER_TIMEOUT_ENABLED        = 1U,
} hal_uart_receiver_timeout_status_t;

/**
  * @brief HAL UART transmitter status definition.
  */
typedef enum
{
  /*! UART Transmitter is disabled */
  HAL_UART_TRANSMITTER_DISABLED            = 0U,
  /*! UART transmitter is enabled */
  HAL_UART_TRANSMITTER_ENABLED             = 1U,
} hal_uart_transmitter_status_t;

/**
  * @brief HAL UART receiver status definition.
  */
typedef enum
{
  /*! UART receiver is disabled */
  HAL_UART_RECEIVER_DISABLED               = 0U,
  /*! UART receiver is enabled */
  HAL_UART_RECEIVER_ENABLED                = 1U,
} hal_uart_receiver_status_t;

/**
  * @}
  */

/** @addtogroup UART_Modes UART Modes Definition
  * @{
  */
/**
  * @brief HAL UART LIN mode status definition.
  */
typedef enum
{
  /*! UART LIN mode is disabled */
  HAL_UART_LIN_MODE_DISABLED               = 0U,
  /*! UART LIN mode is enabled */
  HAL_UART_LIN_MODE_ENABLED                = 1U,
} hal_uart_lin_mode_status_t;

/**
  * @brief HAL UART half-duplex mode status definition.
  */
typedef enum
{
  /*! UART Half Duplex Mode is disabled */
  HAL_UART_HALF_DUPLEX_MODE_DISABLED       = 0U,
  /*! UART Half Duplex Mode is enabled */
  HAL_UART_HALF_DUPLEX_MODE_ENABLED        = 1U,
} hal_uart_half_duplex_mode_status_t;

/**
  * @brief HAL UART RS485 Mode Status Definition.
  */
typedef enum
{
  /*! UART RS485 mode is disabled */
  HAL_UART_RS485_MODE_DISABLED             = 0U,
  /*! UART RS485 mode is enabled */
  HAL_UART_RS485_MODE_ENABLED              = 1U,
} hal_uart_rs485_mode_status_t;

/**
  * @brief HAL UART multiprocessor mode status definition.
  */
typedef enum
{
  /*! UART multiprocessor mode is disabled */
  HAL_UART_MULTI_PROCESSOR_MODE_DISABLED   = 0U,
  /*! UART multiprocessor mode is enabled */
  HAL_UART_MULTI_PROCESSOR_MODE_ENABLED    = 1U,
} hal_uart_multi_processor_mode_status_t;
/**
  * @}
  */

/** @addtogroup UART_Advanced_IO UART Advanced I/O operation Definition
  * @{
  */
/**
  * @brief HAL UART request definition.
  */
typedef enum
{
  /*! Auto-baud rate request. LPUART instances do not support this request.*/
  HAL_UART_REQUEST_AUTO_BAUD_RATE          = LL_USART_REQUEST_AUTO_BAUD_RATE,
  /*! Send Break Request */
  HAL_UART_REQUEST_SEND_BREAK              = LL_USART_REQUEST_SEND_BREAK,
  /*! Mute Mode Request */
  HAL_UART_REQUEST_MUTE_MODE               = LL_USART_REQUEST_MUTE_MODE,
  /*! Receive data flush request */
  HAL_UART_REQUEST_RX_DATA_FLUSH           = LL_USART_REQUEST_RX_DATA_FLUSH,
  /*! Transmit data flush request */
  HAL_UART_REQUEST_TX_DATA_FLUSH           = LL_USART_REQUEST_TX_DATA_FLUSH,
} hal_uart_request_t;

/**
  * @}
  */
/** @defgroup UART_IRDA_PowerMode IRDA power mode Definition
  * @{
  */
/**
  * @brief HAL UART IRDA power mode definition.
  */
typedef enum
{
  /*! IRDA mode normal */
  HAL_UART_IRDA_POWER_MODE_NORMAL          = LL_USART_IRDA_POWER_MODE_NORMAL,
  /*! IRDA mode low power */
  HAL_UART_IRDA_POWER_MODE_LOW             = LL_USART_IRDA_POWER_MODE_LOW,
} hal_uart_irda_power_mode_t;
/**
  * @}
  */

