MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
/*! HAL UART handler type */
typedef struct hal_uart_handle_s hal_uart_handle_t;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/*! HAL UART Generic UART callback Type */
typedef void (* hal_uart_cb_t)(hal_uart_handle_t *huart);

/*! HAL UART Reception Complete Callback Pointer Type */
typedef void (* hal_uart_rx_cplt_cb_t)(hal_uart_handle_t *huart, uint32_t size_byte,
                                       hal_uart_rx_event_types_t rx_event);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

/**
  * @brief HAL UART handle structure type.
  */
struct hal_uart_handle_s
{
  /*! Peripheral instance        */
  hal_uart_t instance;

  /*! Pointer to USART Tx transfer buffer */
  const uint8_t *p_tx_buff;

  /*! USART Tx transfer size              */
  volatile uint32_t tx_xfer_size;

  /*! USART Tx transfer counter           */
  volatile uint32_t tx_xfer_count;

  /*! Pointer to USART Rx transfer buffer */
  uint8_t *p_rx_buff;

  /*! USART Rx transfer size              */
  volatile uint32_t rx_xfer_size;

  /*! USART Rx transfer counter           */
  volatile uint32_t rx_xfer_count;

  /*! USART Rx RDR register mask          */
  volatile uint16_t rdr_mask;

  /*! Specifies whether the FIFO mode is being used. */
  hal_uart_fifo_mode_status_t fifo_mode;

  /*! Number of data to process during RX ISR execution */
  uint16_t nb_rx_data_to_process;

  /*! Number of data to process during TX ISR execution */
  uint16_t nb_tx_data_to_process;

  /*! Type of ongoing reception          */
  volatile hal_uart_rx_modes_t reception_type;

  /*! Function pointer on Rx IRQ handler */
  void (*p_rx_isr)(struct hal_uart_handle_s *huart);

  /*! Function pointer on Tx IRQ handler */
  void (*p_tx_isr)(struct hal_uart_handle_s *huart);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
  /*! USART Tx DMA handle parameters      */
  hal_dma_handle_t *hdma_tx;

  /*! USART Rx DMA handle parameters      */
  hal_dma_handle_t *hdma_rx;

#endif /* USE_HAL_UART_DMA */
  /*! USART state information related to global handle management */
  volatile hal_uart_state_t global_state;

  /*! USART state information related to Rx operations. */
  volatile hal_uart_rx_state_t    rx_state;

  /*! USART state information related to Tx operations. */
  volatile hal_uart_tx_state_t    tx_state;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  /*! USART Tx half complete callback        */
  hal_uart_cb_t p_tx_half_cplt_callback;

  /*! USART Tx complete callback             */
  hal_uart_cb_t p_tx_cplt_callback;

  /*! USART Rx half complete callback        */
  hal_uart_cb_t p_rx_half_cplt_callback;

  /*! USART Rx complete callback             */
  hal_uart_rx_cplt_cb_t p_rx_cplt_callback;

  /*! USART error callback                   */
  hal_uart_cb_t p_error_callback;

  /*! USART abort complete callback          */
  hal_uart_cb_t p_abort_cplt_callback;

  /*! USART abort transmit complete callback */
  hal_uart_cb_t p_abort_transmit_cplt_callback;

  /*! USART abort receive complete callback  */
  hal_uart_cb_t p_abort_receive_cplt_callback;

  /*! USART wake-up callback                  */
  hal_uart_cb_t p_wakeup_callback;

  /*! USART Rx FIFO full callback            */
  hal_uart_cb_t p_rx_fifo_full_callback;

  /*! USART Tx FIFO empty callback           */
  hal_uart_cb_t p_tx_fifo_empty_callback;

  /*! USART clear-to-send callback         */
  hal_uart_cb_t p_clear_to_send_callback;

  /*! USART LIN break callback         */
  hal_uart_cb_t p_lin_break_callback;

#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /*! USART OS semaphore */
  hal_os_semaphore_t semaphore;

#endif /* USE_HAL_MUTEX */
#if defined (USE_HAL_UART_USER_DATA) && (USE_HAL_UART_USER_DATA == 1)
  /*! User Data Pointer */
  const void *p_user_data;

#endif /* USE_HAL_UART_USER_DATA */
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  /*! Last error codes on reception side */
  volatile uint32_t last_reception_error_codes;

  /*! Last error codes on transmission side */
  volatile uint32_t last_transmission_error_codes;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
};


/** @addtogroup UART_Modes UART Modes Definition
  * @{
  */
/**
  * @brief HAL UART multiprocessor communication wake-up from mute mode configuration type.
  */
typedef struct
{
  /*! UART wakeup method (Idle Line/Address). */
  hal_uart_wakeup_method_t wakeup_method;
  /*! Specifies whether the address is 4 or 7-bit long. */
  hal_uart_address_detect_length_t address_length;
  /*! UART node address (7-bit long max). */
  uint8_t address;
} hal_uart_multi_processor_mode_wakeup_config_t;

/**
  * @brief HAL UART RS485 config type.
  */
typedef struct
{
  /*! UART assertion time, value between 0x00 -> 0x1FU in sample time unit (1/8 or 1/16 bit time,
      depending on the oversampling). */
  uint32_t assertion_time_samples;
  /*! UART deassertion time, value between 0x00 -> 0x1FU in sample time unit (1/8 or 1/16 bit time,
      depending on the oversampling). */
  uint32_t deassertion_time_samples;
  /*! UART driver enable (DE) polarity. */
  hal_uart_de_polarity_t polarity;
} hal_uart_rs485_config_t;
/**
  * @}
  */

/** @addtogroup UART_Basic_config
  * @{
  */
/**
  * @brief HAL UART global config structure type.
  */
typedef struct
{
  /*! This member configures the UART communication baud rate.
    Value between Min_Data=0 and Max_Data=18000000.
    For LPUART instances, Min_Data=0 and Max_Data=48000000.
    The baud rate register is computed using the following formula:
        - LPUART:
          - Baud Rate Register = ((256 * lpuart_ker_ckpres) / ((hal_uart_config_t->baud_rate)))
            where lpuart_ker_ck_pres is the UART input clock divided by a prescaler
        - UART:
          - If oversampling is 16 or in LIN mode,
            Baud Rate Register = ((uart_ker_ckpres) / ((hal_uart_config_t->baud_rate)))
          - If oversampling is 8,
            Baud Rate Register[15:4] = ((2 * uart_ker_ckpres) /
            ((hal_uart_config_t->baud_rate)))[15:4]
            Baud Rate Register[3] = 0
            Baud Rate Register[2:0] = (((2 * uart_ker_ckpres) /
            ((hal_uart_config_t->baud_rate)))[3:0]) >> 1
          where uart_ker_ck_pres is the UART input clock divided by a prescaler */
  uint32_t baud_rate;

  /*! Specifies the prescaler value used to divide the UART clock source. */
  hal_uart_prescaler_t clock_prescaler;

  /*! Specifies the number of data bits transmitted or received in a frame. */
  hal_uart_word_length_t word_length;

  /*! Specifies the number of stop bits transmitted. */
  hal_uart_stop_bits_t stop_bits;

  /*! Specifies the parity mode. */
  hal_uart_parity_t parity;

