MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
  /*! Specifies whether the receive or transmit mode is enabled or disabled. */
  hal_uart_direction_t direction;

  /*! Specifies whether the hardware flow control mode is enabled or disabled. */
  hal_uart_hw_control_t hw_flow_ctl;

  /*! Specifies whether oversampling by 8 is enabled or disabled. */
  hal_uart_oversampling_t oversampling;

  /*! Specifies whether single-sample or three-sample majority vote is selected. This parameter
   is not available for LPUART instances. */
  hal_uart_one_bit_sample_t one_bit_sampling;
} hal_uart_config_t;
/**
  * @}
  */

/** @addtogroup UART_IRDA_config
  * @{
  */
/**
  * @brief HAL UART IRDA config structure type.
  */
typedef struct
{
  /*! This member configures the IRDA communication baud rate (value to be set at 115200 baud following IRDA
    specifications). You can, however, still set the value between Min_Data=0 and Max_Data=18000000 for
    specific use cases. The baud rate register is computed using the following formula:
      - Baud Rate Register = ((uart_ker_ckpres) / ((hal_uart_irda_config_t->baud_rate)))
        where uart_ker_ck_pres is the UART input clock divided by a prescaler */
  uint32_t baud_rate;

  /*! Specifies the prescaler value used to divide the IRDA clock source. */
  hal_uart_prescaler_t clock_prescaler;

  /*! Specifies the number of data bits transmitted or received in a frame. */
  hal_uart_word_length_t word_length;

  /*! Specifies the IRDA mode to be used. */
  hal_uart_irda_power_mode_t irda_power_mode;

  /*! Specifies whether the receive or transmit mode is enabled or disabled. */
  hal_uart_direction_t direction;

  /*! Specifies the prescaler value for dividing the UART/USART source clock to achieve low-power frequency.
      Value must be between 0x01 and 0xFF. */
  uint32_t irda_prescaler;

  /*! Specifies the parity mode. */
  hal_uart_parity_t parity;

  /*! Specifies whether single-sample or three-sample majority vote is selected. */
  hal_uart_one_bit_sample_t one_bit_sampling;
} hal_uart_irda_config_t;
/**
  * @}
  */

/**
  * @}
  */

/* Exported Constants --------------------------------------------------------*/
/** @defgroup UART_Exported_Constants HAL UART Constants
  * @{
  */

/** @defgroup UART_Receive_Error_Codes UART Receive Error Codes
  * @{
  */
/*! No error on RX */
#define HAL_UART_RECEIVE_ERROR_NONE     (0UL)

/*! Parity error on RX */
#define HAL_UART_RECEIVE_ERROR_PE       (0x1UL << 0)

/*! Noise error on RX */
#define HAL_UART_RECEIVE_ERROR_NE       (0x1UL << 1U)

/*! Frame error on RX */
#define HAL_UART_RECEIVE_ERROR_FE       (0x1UL << 2U)

/*! Overrun error on RX */
#define HAL_UART_RECEIVE_ERROR_ORE      (0x1UL << 3U)

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
/*! DMA transfer error on RX */
#define HAL_UART_RECEIVE_ERROR_DMA      (0x1UL << 4U)
#endif /* USE_HAL_UART_DMA */

/*! Receiver Timeout error on RX */
#define HAL_UART_RECEIVE_ERROR_RTO      (0x1UL << 5U)
/**
  * @}
  */

/** @defgroup UART_Transmit_Error_Codes UART Transmit Error Codes
  * @{
  */
/*! No error on TX */
#define HAL_UART_TRANSMIT_ERROR_NONE    (0UL << 16U)

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
/*! DMA transfer error on TX */
#define HAL_UART_TRANSMIT_ERROR_DMA     (0x1UL << 17U)
#endif /* USE_HAL_UART_DMA */
/**
  * @}
  */

/** @defgroup UART_Optional_Interrupts UART Optional Interrupts
  * @{
  */

/** @defgroup UART_Transmit_IT_Optional_Interrupts UART Optional Interrupts for Transmit interrupt process
  * @{
  */
/*! Do not activate optional interruptions on TX IT process */
#define HAL_UART_OPT_TX_IT_NONE           0U
/*! Activate FIFO Empty optional interruption */
#define HAL_UART_OPT_TX_IT_FIFO_EMPTY     (1UL << 30U)
/*! Activate clear-to-send optional interruption */
#define HAL_UART_OPT_TX_IT_CLEAR_TO_SEND  (1UL << 29U)
/*! Activate FIFO empty and clear-to-send optional interruptions */
#define HAL_UART_OPT_TX_IT_DEFAULT        (HAL_UART_OPT_TX_IT_FIFO_EMPTY | HAL_UART_OPT_TX_IT_CLEAR_TO_SEND)
/**
  * @}
  */

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
/** @defgroup UART_Transmit_DMA_Optional_Interrupts UART Optional Interrupts for Transmit DMA process
  * @{
  */
/*! Do not activate optional interruptions on TX DMA process */
#define HAL_UART_OPT_DMA_TX_IT_NONE       0U
/*! Activate DMA Half Transfer optional interruption */
#define HAL_UART_OPT_DMA_TX_IT_HT         (HAL_DMA_OPT_IT_HT)
/*! Activate DMA Half Transfer optional interruption */
#define HAL_UART_OPT_DMA_TX_IT_DEFAULT    (HAL_UART_OPT_DMA_TX_IT_HT)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Activate Silent Mode on DMA */
#define HAL_UART_OPT_DMA_TX_IT_SILENT     (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_UART_DMA */

/** @defgroup UART_Receive_IT_Optional_Interrupts UART Optional Interrupts for Receive interrupt process
  * @{
  */
/*! Do not activate optional interruptions on RX IT process */
#define HAL_UART_OPT_RX_IT_NONE           0U
/*! Activate FIFO Full optional interruption */
#define HAL_UART_OPT_RX_IT_FIFO_FULL      (1UL << 25U)
/*! Activate LIN Break optional interruption */
#define HAL_UART_OPT_RX_IT_LIN_BREAK      (1UL << 24U)
/*! Activate FIFO Full optional and LIN Break interruptions */
#define HAL_UART_OPT_RX_IT_DEFAULT        (HAL_UART_OPT_RX_IT_FIFO_FULL | HAL_UART_OPT_RX_IT_LIN_BREAK)
/**
  * @}
  */

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
/** @defgroup UART_Receive_DMA_Optional_Interrupts UART Optional Interrupts for Receive DMA process
  * @{
  */
/*! Do not activate optional interruptions on RX DMA process */
#define HAL_UART_OPT_DMA_RX_IT_NONE       0U
/*! Activate DMA Half Transfer optional interruption */
#define HAL_UART_OPT_DMA_RX_IT_HT         HAL_DMA_OPT_IT_HT
/*! Activate DMA Half Transfer optional interruption */
#define HAL_UART_OPT_DMA_RX_IT_DEFAULT    (HAL_UART_OPT_DMA_RX_IT_HT)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Activate Silent Mode on DMA */
#define HAL_UART_OPT_DMA_RX_IT_SILENT     (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */
#endif /* USE_HAL_UART_DMA */

/**
  * @}
  */
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @defgroup UART_Exported_Functions HAL UART Functions
  * @{
  */

/** @defgroup UART_Exported_Functions_Group1 Initialization and deinitialization functions
  * @{
  */
hal_status_t HAL_UART_Init(hal_uart_handle_t *huart, hal_uart_t instance);
void HAL_UART_DeInit(hal_uart_handle_t *huart);
/**
  * @}
  */

