MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
/** @defgroup UART_Exported_Functions_Group2 Basic configuration functions
  * @{
  */
hal_status_t HAL_UART_SetConfig(hal_uart_handle_t *huart, const hal_uart_config_t *p_config);
void HAL_UART_GetConfig(const hal_uart_handle_t *huart, hal_uart_config_t *p_config);

hal_status_t HAL_UART_SetWordLength(const hal_uart_handle_t *huart, hal_uart_word_length_t word_length);
hal_uart_word_length_t HAL_UART_GetWordLength(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetParity(const hal_uart_handle_t *huart, hal_uart_parity_t parity);
hal_uart_parity_t HAL_UART_GetParity(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetStopBits(const hal_uart_handle_t *huart, hal_uart_stop_bits_t stop_bits);
hal_uart_stop_bits_t HAL_UART_GetStopBits(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetXferDirection(const hal_uart_handle_t *huart, hal_uart_direction_t direction);
hal_uart_direction_t HAL_UART_GetXferDirection(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetHwFlowCtl(const hal_uart_handle_t *huart, hal_uart_hw_control_t hw_flow_ctl);
hal_uart_hw_control_t HAL_UART_GetHwFlowCtl(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetOneBitSample(const hal_uart_handle_t *huart, hal_uart_one_bit_sample_t one_bit_sample);
hal_uart_one_bit_sample_t HAL_UART_GetOneBitSample(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetBaudRate(const hal_uart_handle_t *huart, uint32_t baud_rate);
uint32_t HAL_UART_GetBaudRate(const hal_uart_handle_t *huart);

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group3 IRDA configuration functions
  * @{
  */
hal_status_t HAL_UART_IRDA_SetConfig(hal_uart_handle_t *huart, const hal_uart_irda_config_t *p_config);
void HAL_UART_IRDA_GetConfig(const hal_uart_handle_t *huart, hal_uart_irda_config_t *p_config);

hal_status_t HAL_UART_IRDA_SetPrescaler(const hal_uart_handle_t *huart, uint32_t irda_prescaler);
uint32_t HAL_UART_IRDA_GetPrescaler(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_IRDA_SetPowerMode(const hal_uart_handle_t *huart,
                                        hal_uart_irda_power_mode_t irda_power_mode);
hal_uart_irda_power_mode_t HAL_UART_IRDA_GetPowerMode(const hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group4 Mode configuration functions
  * @{
  */
hal_status_t HAL_UART_EnableLINMode(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableLINMode(const hal_uart_handle_t *huart);
hal_uart_lin_mode_status_t HAL_UART_IsEnabledLINMode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetLINModeBreakDetectLength(const hal_uart_handle_t *huart,
                                                  hal_uart_lin_break_detect_length_t break_detect_length);
hal_uart_lin_break_detect_length_t HAL_UART_GetLINModeBreakDetectLength(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableRS485Mode(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableRS485Mode(const hal_uart_handle_t *huart);
hal_uart_rs485_mode_status_t HAL_UART_IsEnabledRS485Mode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetConfigRS485Mode(const hal_uart_handle_t *huart, const hal_uart_rs485_config_t *p_config);
void HAL_UART_GetConfigRS485Mode(const hal_uart_handle_t *huart, hal_uart_rs485_config_t *p_config);

hal_status_t HAL_UART_EnableHalfDuplexMode(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableHalfDuplexMode(const hal_uart_handle_t *huart);
hal_uart_half_duplex_mode_status_t HAL_UART_IsEnabledHalfDuplexMode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableMultiProcessorMode(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableMultiProcessorMode(const hal_uart_handle_t *huart);
hal_uart_multi_processor_mode_status_t HAL_UART_IsEnabledMultiProcessorMode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetConfigMultiProcessorMode(const hal_uart_handle_t *huart,
                                                  const hal_uart_multi_processor_mode_wakeup_config_t *p_wakeup_config);
void HAL_UART_GetConfigMultiProcessorMode(const hal_uart_handle_t *huart,
                                          hal_uart_multi_processor_mode_wakeup_config_t *p_wakeup_config);
hal_status_t HAL_UART_EnterMultiProcessorMuteMode(const hal_uart_handle_t *huart);
hal_uart_multi_processor_mode_mute_status_t HAL_UART_IsEnteredMultiProcessorMuteMode(const hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group5 Advanced configuration functions
  * @{
  */

hal_status_t HAL_UART_EnableTxPinLevelInvert(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableTxPinLevelInvert(const hal_uart_handle_t *huart);
hal_uart_tx_pin_level_invert_status_t HAL_UART_IsEnabledTxPinLevelInvert(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableRxPinLevelInvert(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableRxPinLevelInvert(const hal_uart_handle_t *huart);
hal_uart_rx_pin_level_invert_status_t HAL_UART_IsEnabledRxPinLevelInvert(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableDataInvert(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableDataInvert(const hal_uart_handle_t *huart);
hal_uart_data_invert_status_t HAL_UART_IsEnabledDataInvert(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableTxRxSwap(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableTxRxSwap(const hal_uart_handle_t *huart);
hal_uart_tx_rx_swap_status_t HAL_UART_IsEnabledTxRxSwap(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableRxOverRunDetection(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableRxOverRunDetection(const hal_uart_handle_t *huart);
hal_uart_rx_overrun_detection_status_t HAL_UART_IsEnabledRxOverRunDetection(const hal_uart_handle_t *huart);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1U)
hal_status_t HAL_UART_EnableDMAStopOnRxError(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableDMAStopOnRxError(const hal_uart_handle_t *huart);
hal_uart_dma_stop_on_rx_error_status_t HAL_UART_IsEnabledDMAStopOnRxError(const hal_uart_handle_t *huart);
#endif /* USE_HAL_UART_DMA */

hal_status_t HAL_UART_EnableMSBFirst(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableMSBFirst(const hal_uart_handle_t *huart);
hal_uart_msb_first_status_t HAL_UART_IsEnabledMSBFirst(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetConfigReceiverTimeout(const hal_uart_handle_t *huart, uint32_t timeout_bit);
uint32_t HAL_UART_GetConfigReceiverTimeout(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_EnableReceiverTimeout(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableReceiverTimeout(const hal_uart_handle_t *huart);
hal_uart_receiver_timeout_status_t HAL_UART_IsEnabledReceiverTimeout(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_EnableTransmitter(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableTransmitter(const hal_uart_handle_t *huart);
hal_uart_transmitter_status_t HAL_UART_IsEnabledTransmitter(const hal_uart_handle_t *huart);

