MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
hal_status_t HAL_UART_EnableReceiver(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableReceiver(const hal_uart_handle_t *huart);
hal_uart_receiver_status_t HAL_UART_IsEnabledReceiver(const hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group6 Auto Baud Rate Configuration functions
  * @{
  */
hal_status_t HAL_UART_EnableAutoBaudRate(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableAutoBaudRate(const hal_uart_handle_t *huart);
hal_uart_auto_baud_rate_status_t HAL_UART_IsEnabledAutoBaudRate(const hal_uart_handle_t *huart);
hal_uart_auto_baud_rate_detection_status_t HAL_UART_GetAutoBaudRateStatus(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetConfigAutoBaudRateMode(const hal_uart_handle_t *huart,
                                                hal_uart_auto_baud_rate_mode_t auto_baud_rate_mode);
hal_uart_auto_baud_rate_mode_t HAL_UART_GetConfigAutoBaudRateMode(const hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group7 Stop Mode Configuration functions
  * @{
  */
hal_status_t HAL_UART_EnableStopMode(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableStopMode(const hal_uart_handle_t *huart);
hal_uart_stop_mode_status_t HAL_UART_IsEnabledStopMode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetStopModeWkUpSource(const hal_uart_handle_t *huart, const hal_uart_wakeup_source_t source);
hal_uart_wakeup_source_t HAL_UART_GetStopModeWkUpSource(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetStopModeWkUpAddrLength(const hal_uart_handle_t *huart,
                                                const hal_uart_address_detect_length_t address_length);
hal_uart_address_detect_length_t HAL_UART_GetStopModeWkUpAddrLength(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetStopModeWkUpAddr(const hal_uart_handle_t *huart, uint8_t address);
uint8_t HAL_UART_GetStopModeWkUpAddr(const hal_uart_handle_t *huart);

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group8 FIFO Configuration functions
  * @{
  */
hal_status_t HAL_UART_EnableFifoMode(hal_uart_handle_t *huart);
hal_status_t HAL_UART_DisableFifoMode(hal_uart_handle_t *huart);
hal_uart_fifo_mode_status_t HAL_UART_IsEnabledFifoMode(const hal_uart_handle_t *huart);

hal_status_t HAL_UART_SetTxFifoThreshold(hal_uart_handle_t *huart, hal_uart_fifo_threshold_t tx_fifo_threshold);
hal_uart_fifo_threshold_t HAL_UART_GetTxFifoThreshold(const hal_uart_handle_t *huart);
hal_status_t HAL_UART_SetRxFifoThreshold(hal_uart_handle_t *huart, hal_uart_fifo_threshold_t rx_fifo_threshold);
hal_uart_fifo_threshold_t HAL_UART_GetRxFifoThreshold(const hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group10 DMA Configuration functions
  * @{
  */
#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
hal_status_t HAL_UART_SetTxDMA(hal_uart_handle_t *huart, hal_dma_handle_t *hdma_tx);
hal_status_t HAL_UART_SetRxDMA(hal_uart_handle_t *huart, hal_dma_handle_t *hdma_rx);
#endif /* USE_HAL_UART_DMA */

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group11 Callbacks Register functions
  * @{
  */
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)

hal_status_t HAL_UART_RegisterTxHalfCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterTxCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterRxHalfCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterRxCpltCallback(hal_uart_handle_t *huart, hal_uart_rx_cplt_cb_t p_callback);
hal_status_t HAL_UART_RegisterErrorCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterAbortCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterAbortTransmitCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterAbortReceiveCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);

hal_status_t HAL_UART_RegisterWakeupCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);

hal_status_t HAL_UART_RegisterRxFifoFullCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);
hal_status_t HAL_UART_RegisterTxFifoEmptyCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);

hal_status_t HAL_UART_RegisterClearToSendCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);

hal_status_t HAL_UART_RegisterLINBreakCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback);

#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group12 I/O operation functions
  * @{
  */

hal_status_t HAL_UART_Transmit(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_UART_Receive(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_UART_Transmit_IT(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte);
hal_status_t HAL_UART_Receive_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte);
hal_status_t HAL_UART_Transmit_IT_Opt(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte,
                                      uint32_t interrupts);
hal_status_t HAL_UART_Receive_IT_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte, uint32_t interrupts);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
hal_status_t HAL_UART_Transmit_DMA(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte);
hal_status_t HAL_UART_Receive_DMA(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte);
hal_status_t HAL_UART_Transmit_DMA_Opt(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte,
                                       uint32_t interrupts);
hal_status_t HAL_UART_Receive_DMA_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte, uint32_t interrupts);
hal_status_t HAL_UART_Pause_DMA(hal_uart_handle_t *huart);
hal_status_t HAL_UART_PauseReceive_DMA(hal_uart_handle_t *huart);
hal_status_t HAL_UART_PauseTransmit_DMA(hal_uart_handle_t *huart);

