MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.h
hal_status_t HAL_UART_Resume_DMA(hal_uart_handle_t *huart);
hal_status_t HAL_UART_ResumeReceive_DMA(hal_uart_handle_t *huart);
hal_status_t HAL_UART_ResumeTransmit_DMA(hal_uart_handle_t *huart);
#endif /* USE_HAL_UART_DMA */

/* Transfer Abort functions */
hal_status_t HAL_UART_Abort(hal_uart_handle_t *huart);
hal_status_t HAL_UART_AbortTransmit(hal_uart_handle_t *huart);
hal_status_t HAL_UART_AbortReceive(hal_uart_handle_t *huart);
hal_status_t HAL_UART_Abort_IT(hal_uart_handle_t *huart);
hal_status_t HAL_UART_AbortTransmit_IT(hal_uart_handle_t *huart);
hal_status_t HAL_UART_AbortReceive_IT(hal_uart_handle_t *huart);

/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group13 Advanced I/O operation functions
  * @{
  */
hal_status_t HAL_UART_SendLINBreak(hal_uart_handle_t *huart);
hal_status_t HAL_UART_SendRequest(hal_uart_handle_t *huart, hal_uart_request_t request);

hal_status_t HAL_UART_ReceiveToIdle(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                    uint32_t *p_rx_size_byte, uint32_t timeout_ms);
hal_status_t HAL_UART_ReceiveToIdle_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte);

hal_status_t HAL_UART_ReceiveToIdle_IT_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                           uint32_t interrupts);

hal_status_t HAL_UART_ReceiveUntilTMO(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                      uint32_t *p_rx_size_byte, uint32_t char_timeout_bit);
hal_status_t HAL_UART_ReceiveUntilTMO_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                         uint32_t char_timeout_bit);

hal_status_t HAL_UART_ReceiveUntilTMO_IT_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                             uint32_t char_timeout_bit, uint32_t interrupts);

hal_status_t HAL_UART_ReceiveUntilCM(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                     uint8_t character, uint32_t *p_rx_size_byte, uint32_t timeout_ms);
hal_status_t HAL_UART_ReceiveUntilCM_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                        uint8_t character);

hal_status_t HAL_UART_ReceiveUntilCM_IT_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                            uint8_t character, uint32_t interrupts);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
hal_status_t HAL_UART_ReceiveToIdle_DMA(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte);
hal_status_t HAL_UART_ReceiveUntilTMO_DMA(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                          uint32_t char_timeout_bit);
hal_status_t HAL_UART_ReceiveUntilCM_DMA(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                         uint8_t character);

hal_status_t HAL_UART_ReceiveToIdle_DMA_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                            uint32_t interrupts);
hal_status_t HAL_UART_ReceiveUntilTMO_DMA_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                              uint32_t char_timeout_bit, uint32_t interrupts);
hal_status_t HAL_UART_ReceiveUntilCM_DMA_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                             uint8_t character, uint32_t interrupts);
#endif /* USE_HAL_UART_DMA */

/**
  * @}
  */
/** @defgroup UART_Exported_Functions_Group14 Peripheral current frequency, state and error functions
  * @{
  */

/* Peripheral current frequency, state and error functions *********************************/
uint32_t HAL_UART_GetClockFreq(const hal_uart_handle_t *huart);
hal_uart_state_t HAL_UART_GetState(const hal_uart_handle_t *huart);
hal_uart_tx_state_t HAL_UART_GetTxState(const hal_uart_handle_t *huart);
hal_uart_rx_state_t HAL_UART_GetRxState(const hal_uart_handle_t *huart);

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
uint32_t HAL_UART_GetLastErrorCodes(const hal_uart_handle_t *huart);
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup UART_Exported_Functions_Group15 Bus Operation Function
  * @{
  */
hal_status_t HAL_UART_AcquireBus(hal_uart_handle_t *huart, uint32_t timeout_ms);
hal_status_t HAL_UART_ReleaseBus(hal_uart_handle_t *huart);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_UART_USER_DATA) && (USE_HAL_UART_USER_DATA == 1)
/** @defgroup UART_Exported_Functions_Group16 User Data Function
  * @{
  */
void HAL_UART_SetUserData(hal_uart_handle_t *huart, const void *p_user_data);
const void *HAL_UART_GetUserData(const hal_uart_handle_t *huart);
/**
  * @}
  */
#endif /* USE_HAL_UART_USER_DATA */

/** @defgroup UART_Exported_Functions_Group17 IRQ handling
  * @{
  */
void HAL_UART_IRQHandler(hal_uart_handle_t *huart);
/**
  * @}
  */

/** @defgroup UART_Exported_Functions_Group18 Default Callbacks
  * @{
  */

/* Default callback */
void HAL_UART_TxHalfCpltCallback(hal_uart_handle_t *huart);
void HAL_UART_TxCpltCallback(hal_uart_handle_t *huart);
void HAL_UART_RxHalfCpltCallback(hal_uart_handle_t *huart);
void HAL_UART_RxCpltCallback(hal_uart_handle_t *huart, uint32_t size_byte, hal_uart_rx_event_types_t rx_event);
void HAL_UART_ErrorCallback(hal_uart_handle_t *huart);
void HAL_UART_AbortCpltCallback(hal_uart_handle_t *huart);
void HAL_UART_AbortTransmitCpltCallback(hal_uart_handle_t *huart);
void HAL_UART_AbortReceiveCpltCallback(hal_uart_handle_t *huart);

void HAL_UART_WakeupCallback(hal_uart_handle_t *huart);

void HAL_UART_RxFifoFullCallback(hal_uart_handle_t *huart);
void HAL_UART_TxFifoEmptyCallback(hal_uart_handle_t *huart);

void HAL_UART_LINBreakCallback(hal_uart_handle_t *huart);
void HAL_UART_ClearToSendCallback(hal_uart_handle_t *huart);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 || LPUART1 */
/**
  * @}
  */
#endif /* STM32C5XX_HAL_UART_H */
